# Correspondence between latex syntax and special characters

e <- list()

e[["{\a'e}"]] <- "é"
e[["{\a`e}"]] <- "è"
#e[["{\c c}"]] <- "ç"

e[["{\~a}"]] <- "ã"
e[["{\a'\i}"]] <- "í"
e[["{\a'a}"]] <- "á"
e[["{\a'o}"]] <- "ó"

e[["{\~n}"]] <- "ñ"

e[["{\"a}"]] <- "ä"
e[["{\"e}"]] <- "ë"
e[["{\"\i}"]] <- "ï"
e[["{\"u}"]] <- "ü"
e[["{\"o}"]] <- "ö"

e[["{\^o}"]] <- "ô"
e[["{\^\i}"]] <- "î"

e[["{\r a}"]] <- "å"
e[["{\r A}"]] <- "Å"

e[["{\v z}"]] <- "ž"
e[["{\a`y}"]] <- "ý"
e[["{\v Z}"]] <- "Ž"
e[["{\v c}"]] <- "č"

e[["{\o}"]] <- "ø"



